In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
array = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [8]:
d

{'a': 10, 'b': 20, 'c': 30}

In [9]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data = my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
ser1 = pd.Series([1,2,3,4],["Kottayam","Kochi","Pala","Kollam"])

In [15]:
ser1

Kottayam    1
Kochi       2
Pala        3
Kollam      4
dtype: int64

In [17]:
ser2 = pd.Series([5,6,7,8],["Bremen","berlin","hamburg","munich"])

In [18]:
ser2

Bremen     5
berlin     6
hamburg    7
munich     8
dtype: int64

In [20]:
ser1["Kottayam"]

np.int64(1)

In [21]:
ser1+ser2

Bremen     NaN
Kochi      NaN
Kollam     NaN
Kottayam   NaN
Pala       NaN
berlin     NaN
hamburg    NaN
munich     NaN
dtype: float64

Data Frames

In [3]:
from numpy.random import randn

In [5]:
np.random.seed(101) # np.random.seed()is used to generate a pseudo random number .If two poeple put np.random.seed(101 or any same number), both users will get a same psuedo random number

In [6]:
df = pd.DataFrame(randn(5,4),["a","b","c","d","e"],["W","X","Y","Z"])

Columns

In [7]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [8]:
df["W"]

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: W, dtype: float64

In [10]:
type(df["W"])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df[["W","Z"]]

          W         Z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [13]:
df["new"]=df["W"]+df["Z"]

In [14]:
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [18]:
df.drop("new", axis=1) # this is just temporary drop and not permanent drop from the dataframe

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [16]:
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [19]:
# For permanently dropping
df.drop("new",axis=1,inplace=True)

In [20]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [23]:
df.drop("e") # axis = 0 by default

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [25]:
df.shape #shape of the dataframe

(5, 4)

ROWS

In [26]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [27]:
df.loc["c"]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: c, dtype: float64

In [28]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: c, dtype: float64

In [30]:
#Locating an element from DF
df.loc["c","Y"]

np.float64(0.5288134940893595)

In [31]:
# For getting multiple elements from from a dataframe
df.loc[["a","b"],["Y","Z"]]

          Y         Z
a  0.907969  0.503826
b -0.848077  0.605965

In [32]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

Conditional Selection using DataFrame

In [33]:
df>0

       W      X      Y      Z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [34]:
df[df>1]

         W         X         Y   Z
a  2.70685       NaN       NaN NaN
b      NaN       NaN       NaN NaN
c      NaN       NaN       NaN NaN
d      NaN       NaN       NaN NaN
e      NaN  1.978757  2.605967 NaN

In [35]:
df[df<-2]

          W   X   Y   Z
a       NaN NaN NaN NaN
b       NaN NaN NaN NaN
c -2.018168 NaN NaN NaN
d       NaN NaN NaN NaN
e       NaN NaN NaN NaN

In [40]:
df[df["W"]>1]

         W         X         Y         Z
a  2.70685  0.628133  0.907969  0.503826

In [41]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [58]:
df["Z"]>0

a     True
b     True
c    False
d     True
e     True
Name: Z, dtype: bool

In [54]:
df[df["W"]>0][["X","Y"]]

          X         Y
a  0.628133  0.907969
b -0.319318 -0.848077
d -0.758872 -0.933237
e  1.978757  2.605967

Multiple Conditions

In [59]:
# and operation
df[(df["W"]>0) & (df["Y"]>1)]

          W         X         Y         Z
e  0.190794  1.978757  2.605967  0.683509

In [61]:
# or operation
df[(df["W"]>0) | (df["Y"]>1)]

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [62]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [74]:
# to reset index to stock pandas index(0,1,2....) // TEMPORARY
#The old index will become a column of the dataframe
df.reset_index()

  index         W         X         Y         Z
0     a  0.302665  1.693723 -1.706086 -1.159119
1     b -0.134841  0.390528  0.166905  0.184502
2     c  0.807706  0.072960  0.638787  0.329646
3     d -0.497104 -0.754070 -0.943406  0.484752
4     e -0.116773  1.901755  0.238127  1.996652

In [65]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
# PERMANENT Index RESET
df.reset_index(inplace=True)

In [71]:
df

  index         W         X         Y         Z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.reset_index(inplace=F)

   level_0 index         W         X         Y         Z
0        0     a  2.706850  0.628133  0.907969  0.503826
1        1     b  0.651118 -0.319318 -0.848077  0.605965
2        2     c -2.018168  0.740122  0.528813 -0.589001
3        3     d  0.188695 -0.758872 -0.933237  0.955057
4        4     e  0.190794  1.978757  2.605967  0.683509

In [72]:
df = pd.DataFrame(randn(5,4),["a","b","c","d","e"],["W","X","Y","Z"])

In [75]:
df

          W         X         Y         Z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652